Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/pwm.h
/* -------- PWM_CDTY : (PWM Offset: 0x04) (R/W 32) PWM Channel Duty Cycle Register -------- */
#define PWM_CDTY_CDTY_Pos                     _UINT32_(0)                                          /* (PWM_CDTY) Channel Duty-Cycle Position */
#define PWM_CDTY_CDTY_Msk                     (_UINT32_(0xFFFFFF) << PWM_CDTY_CDTY_Pos)            /* (PWM_CDTY) Channel Duty-Cycle Mask */
#define PWM_CDTY_CDTY(value)                  (PWM_CDTY_CDTY_Msk & (_UINT32_(value) << PWM_CDTY_CDTY_Pos)) /* Assigment of value for CDTY in the PWM_CDTY register */
#define PWM_CDTY_Msk                          _UINT32_(0x00FFFFFF)                                 /* (PWM_CDTY) Register Mask  */


/* -------- PWM_CDTYUPD : (PWM Offset: 0x08) ( /W 32) PWM Channel Duty Cycle Update Register -------- */
#define PWM_CDTYUPD_CDTYUPD_Pos               _UINT32_(0)                                          /* (PWM_CDTYUPD) Channel Duty-Cycle Update Position */
#define PWM_CDTYUPD_CDTYUPD_Msk               (_UINT32_(0xFFFFFF) << PWM_CDTYUPD_CDTYUPD_Pos)      /* (PWM_CDTYUPD) Channel Duty-Cycle Update Mask */
#define PWM_CDTYUPD_CDTYUPD(value)            (PWM_CDTYUPD_CDTYUPD_Msk & (_UINT32_(value) << PWM_CDTYUPD_CDTYUPD_Pos)) /* Assigment of value for CDTYUPD in the PWM_CDTYUPD register */
#define PWM_CDTYUPD_Msk                       _UINT32_(0x00FFFFFF)                                 /* (PWM_CDTYUPD) Register Mask  */


/* -------- PWM_CPRD : (PWM Offset: 0x0C) (R/W 32) PWM Channel Period Register -------- */
#define PWM_CPRD_CPRD_Pos                     _UINT32_(0)                                          /* (PWM_CPRD) Channel Period Position */
#define PWM_CPRD_CPRD_Msk                     (_UINT32_(0xFFFFFF) << PWM_CPRD_CPRD_Pos)            /* (PWM_CPRD) Channel Period Mask */
#define PWM_CPRD_CPRD(value)                  (PWM_CPRD_CPRD_Msk & (_UINT32_(value) << PWM_CPRD_CPRD_Pos)) /* Assigment of value for CPRD in the PWM_CPRD register */
#define PWM_CPRD_Msk                          _UINT32_(0x00FFFFFF)                                 /* (PWM_CPRD) Register Mask  */


/* -------- PWM_CPRDUPD : (PWM Offset: 0x10) ( /W 32) PWM Channel Period Update Register -------- */
#define PWM_CPRDUPD_CPRDUPD_Pos               _UINT32_(0)                                          /* (PWM_CPRDUPD) Channel Period Update Position */
#define PWM_CPRDUPD_CPRDUPD_Msk               (_UINT32_(0xFFFFFF) << PWM_CPRDUPD_CPRDUPD_Pos)      /* (PWM_CPRDUPD) Channel Period Update Mask */
#define PWM_CPRDUPD_CPRDUPD(value)            (PWM_CPRDUPD_CPRDUPD_Msk & (_UINT32_(value) << PWM_CPRDUPD_CPRDUPD_Pos)) /* Assigment of value for CPRDUPD in the PWM_CPRDUPD register */
#define PWM_CPRDUPD_Msk                       _UINT32_(0x00FFFFFF)                                 /* (PWM_CPRDUPD) Register Mask  */


/* -------- PWM_CCNT : (PWM Offset: 0x14) ( R/ 32) PWM Channel Counter Register -------- */
#define PWM_CCNT_CNT_Pos                      _UINT32_(0)                                          /* (PWM_CCNT) Channel Counter Register Position */
#define PWM_CCNT_CNT_Msk                      (_UINT32_(0xFFFFFF) << PWM_CCNT_CNT_Pos)             /* (PWM_CCNT) Channel Counter Register Mask */
#define PWM_CCNT_CNT(value)                   (PWM_CCNT_CNT_Msk & (_UINT32_(value) << PWM_CCNT_CNT_Pos)) /* Assigment of value for CNT in the PWM_CCNT register */
#define PWM_CCNT_Msk                          _UINT32_(0x00FFFFFF)                                 /* (PWM_CCNT) Register Mask  */


/* -------- PWM_DT : (PWM Offset: 0x18) (R/W 32) PWM Channel Dead Time Register -------- */
#define PWM_DT_DTH_Pos                        _UINT32_(0)                                          /* (PWM_DT) Dead-Time Value for PWMHx Output Position */
#define PWM_DT_DTH_Msk                        (_UINT32_(0xFFFF) << PWM_DT_DTH_Pos)                 /* (PWM_DT) Dead-Time Value for PWMHx Output Mask */
#define PWM_DT_DTH(value)                     (PWM_DT_DTH_Msk & (_UINT32_(value) << PWM_DT_DTH_Pos)) /* Assigment of value for DTH in the PWM_DT register */
#define PWM_DT_DTL_Pos                        _UINT32_(16)                                         /* (PWM_DT) Dead-Time Value for PWMLx Output Position */
#define PWM_DT_DTL_Msk                        (_UINT32_(0xFFFF) << PWM_DT_DTL_Pos)                 /* (PWM_DT) Dead-Time Value for PWMLx Output Mask */
#define PWM_DT_DTL(value)                     (PWM_DT_DTL_Msk & (_UINT32_(value) << PWM_DT_DTL_Pos)) /* Assigment of value for DTL in the PWM_DT register */
#define PWM_DT_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (PWM_DT) Register Mask  */


/* -------- PWM_DTUPD : (PWM Offset: 0x1C) ( /W 32) PWM Channel Dead Time Update Register -------- */
#define PWM_DTUPD_DTHUPD_Pos                  _UINT32_(0)                                          /* (PWM_DTUPD) Dead-Time Value Update for PWMHx Output Position */
#define PWM_DTUPD_DTHUPD_Msk                  (_UINT32_(0xFFFF) << PWM_DTUPD_DTHUPD_Pos)           /* (PWM_DTUPD) Dead-Time Value Update for PWMHx Output Mask */
#define PWM_DTUPD_DTHUPD(value)               (PWM_DTUPD_DTHUPD_Msk & (_UINT32_(value) << PWM_DTUPD_DTHUPD_Pos)) /* Assigment of value for DTHUPD in the PWM_DTUPD register */
#define PWM_DTUPD_DTLUPD_Pos                  _UINT32_(16)                                         /* (PWM_DTUPD) Dead-Time Value Update for PWMLx Output Position */
#define PWM_DTUPD_DTLUPD_Msk                  (_UINT32_(0xFFFF) << PWM_DTUPD_DTLUPD_Pos)           /* (PWM_DTUPD) Dead-Time Value Update for PWMLx Output Mask */
#define PWM_DTUPD_DTLUPD(value)               (PWM_DTUPD_DTLUPD_Msk & (_UINT32_(value) << PWM_DTUPD_DTLUPD_Pos)) /* Assigment of value for DTLUPD in the PWM_DTUPD register */
#define PWM_DTUPD_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (PWM_DTUPD) Register Mask  */


/* -------- PWM_CMPV : (PWM Offset: 0x00) (R/W 32) PWM Comparison Value Register -------- */
#define PWM_CMPV_CV_Pos                       _UINT32_(0)                                          /* (PWM_CMPV) Comparison x Value Position */
#define PWM_CMPV_CV_Msk                       (_UINT32_(0xFFFFFF) << PWM_CMPV_CV_Pos)              /* (PWM_CMPV) Comparison x Value Mask */
#define PWM_CMPV_CV(value)                    (PWM_CMPV_CV_Msk & (_UINT32_(value) << PWM_CMPV_CV_Pos)) /* Assigment of value for CV in the PWM_CMPV register */
#define PWM_CMPV_CVM_Pos                      _UINT32_(24)                                         /* (PWM_CMPV) Comparison x Value Mode Position */
#define PWM_CMPV_CVM_Msk                      (_UINT32_(0x1) << PWM_CMPV_CVM_Pos)                  /* (PWM_CMPV) Comparison x Value Mode Mask */
#define PWM_CMPV_CVM(value)                   (PWM_CMPV_CVM_Msk & (_UINT32_(value) << PWM_CMPV_CVM_Pos)) /* Assigment of value for CVM in the PWM_CMPV register */
#define   PWM_CMPV_CVM_COMPARE_AT_INCREMENT_Val _UINT32_(0x0)                                        /* (PWM_CMPV) Compare when counter is incrementing  */
#define   PWM_CMPV_CVM_COMPARE_AT_DECREMENT_Val _UINT32_(0x1)                                        /* (PWM_CMPV) Compare when counter is decrementing  */
#define PWM_CMPV_CVM_COMPARE_AT_INCREMENT     (PWM_CMPV_CVM_COMPARE_AT_INCREMENT_Val << PWM_CMPV_CVM_Pos) /* (PWM_CMPV) Compare when counter is incrementing Position  */
#define PWM_CMPV_CVM_COMPARE_AT_DECREMENT     (PWM_CMPV_CVM_COMPARE_AT_DECREMENT_Val << PWM_CMPV_CVM_Pos) /* (PWM_CMPV) Compare when counter is decrementing Position  */
#define PWM_CMPV_Msk                          _UINT32_(0x01FFFFFF)                                 /* (PWM_CMPV) Register Mask  */


