Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/pwm.h
/* -------- PWM_CMPVUPD : (PWM Offset: 0x04) ( /W 32) PWM Comparison Value Update Register -------- */
#define PWM_CMPVUPD_CVUPD_Pos                 _UINT32_(0)                                          /* (PWM_CMPVUPD) Comparison x Value Update Position */
#define PWM_CMPVUPD_CVUPD_Msk                 (_UINT32_(0xFFFFFF) << PWM_CMPVUPD_CVUPD_Pos)        /* (PWM_CMPVUPD) Comparison x Value Update Mask */
#define PWM_CMPVUPD_CVUPD(value)              (PWM_CMPVUPD_CVUPD_Msk & (_UINT32_(value) << PWM_CMPVUPD_CVUPD_Pos)) /* Assigment of value for CVUPD in the PWM_CMPVUPD register */
#define PWM_CMPVUPD_CVMUPD_Pos                _UINT32_(24)                                         /* (PWM_CMPVUPD) Comparison x Value Mode Update Position */
#define PWM_CMPVUPD_CVMUPD_Msk                (_UINT32_(0x1) << PWM_CMPVUPD_CVMUPD_Pos)            /* (PWM_CMPVUPD) Comparison x Value Mode Update Mask */
#define PWM_CMPVUPD_CVMUPD(value)             (PWM_CMPVUPD_CVMUPD_Msk & (_UINT32_(value) << PWM_CMPVUPD_CVMUPD_Pos)) /* Assigment of value for CVMUPD in the PWM_CMPVUPD register */
#define PWM_CMPVUPD_Msk                       _UINT32_(0x01FFFFFF)                                 /* (PWM_CMPVUPD) Register Mask  */


/* -------- PWM_CMPM : (PWM Offset: 0x08) (R/W 32) PWM Comparison Mode Register -------- */
#define PWM_CMPM_CEN_Pos                      _UINT32_(0)                                          /* (PWM_CMPM) Comparison x Enable Position */
#define PWM_CMPM_CEN_Msk                      (_UINT32_(0x1) << PWM_CMPM_CEN_Pos)                  /* (PWM_CMPM) Comparison x Enable Mask */
#define PWM_CMPM_CEN(value)                   (PWM_CMPM_CEN_Msk & (_UINT32_(value) << PWM_CMPM_CEN_Pos)) /* Assigment of value for CEN in the PWM_CMPM register */
#define PWM_CMPM_CTR_Pos                      _UINT32_(4)                                          /* (PWM_CMPM) Comparison x Trigger Position */
#define PWM_CMPM_CTR_Msk                      (_UINT32_(0xF) << PWM_CMPM_CTR_Pos)                  /* (PWM_CMPM) Comparison x Trigger Mask */
#define PWM_CMPM_CTR(value)                   (PWM_CMPM_CTR_Msk & (_UINT32_(value) << PWM_CMPM_CTR_Pos)) /* Assigment of value for CTR in the PWM_CMPM register */
#define PWM_CMPM_CPR_Pos                      _UINT32_(8)                                          /* (PWM_CMPM) Comparison x Period Position */
#define PWM_CMPM_CPR_Msk                      (_UINT32_(0xF) << PWM_CMPM_CPR_Pos)                  /* (PWM_CMPM) Comparison x Period Mask */
#define PWM_CMPM_CPR(value)                   (PWM_CMPM_CPR_Msk & (_UINT32_(value) << PWM_CMPM_CPR_Pos)) /* Assigment of value for CPR in the PWM_CMPM register */
#define PWM_CMPM_CPRCNT_Pos                   _UINT32_(12)                                         /* (PWM_CMPM) Comparison x Period Counter Position */
#define PWM_CMPM_CPRCNT_Msk                   (_UINT32_(0xF) << PWM_CMPM_CPRCNT_Pos)               /* (PWM_CMPM) Comparison x Period Counter Mask */
#define PWM_CMPM_CPRCNT(value)                (PWM_CMPM_CPRCNT_Msk & (_UINT32_(value) << PWM_CMPM_CPRCNT_Pos)) /* Assigment of value for CPRCNT in the PWM_CMPM register */
#define PWM_CMPM_CUPR_Pos                     _UINT32_(16)                                         /* (PWM_CMPM) Comparison x Update Period Position */
#define PWM_CMPM_CUPR_Msk                     (_UINT32_(0xF) << PWM_CMPM_CUPR_Pos)                 /* (PWM_CMPM) Comparison x Update Period Mask */
#define PWM_CMPM_CUPR(value)                  (PWM_CMPM_CUPR_Msk & (_UINT32_(value) << PWM_CMPM_CUPR_Pos)) /* Assigment of value for CUPR in the PWM_CMPM register */
#define PWM_CMPM_CUPRCNT_Pos                  _UINT32_(20)                                         /* (PWM_CMPM) Comparison x Update Period Counter Position */
#define PWM_CMPM_CUPRCNT_Msk                  (_UINT32_(0xF) << PWM_CMPM_CUPRCNT_Pos)              /* (PWM_CMPM) Comparison x Update Period Counter Mask */
#define PWM_CMPM_CUPRCNT(value)               (PWM_CMPM_CUPRCNT_Msk & (_UINT32_(value) << PWM_CMPM_CUPRCNT_Pos)) /* Assigment of value for CUPRCNT in the PWM_CMPM register */
#define PWM_CMPM_Msk                          _UINT32_(0x00FFFFF1)                                 /* (PWM_CMPM) Register Mask  */


/* -------- PWM_CMPMUPD : (PWM Offset: 0x0C) ( /W 32) PWM Comparison Mode Update Register -------- */
#define PWM_CMPMUPD_CENUPD_Pos                _UINT32_(0)                                          /* (PWM_CMPMUPD) Comparison x Enable Update Position */
#define PWM_CMPMUPD_CENUPD_Msk                (_UINT32_(0x1) << PWM_CMPMUPD_CENUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Enable Update Mask */
#define PWM_CMPMUPD_CENUPD(value)             (PWM_CMPMUPD_CENUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CENUPD_Pos)) /* Assigment of value for CENUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CTRUPD_Pos                _UINT32_(4)                                          /* (PWM_CMPMUPD) Comparison x Trigger Update Position */
#define PWM_CMPMUPD_CTRUPD_Msk                (_UINT32_(0xF) << PWM_CMPMUPD_CTRUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Trigger Update Mask */
#define PWM_CMPMUPD_CTRUPD(value)             (PWM_CMPMUPD_CTRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CTRUPD_Pos)) /* Assigment of value for CTRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CPRUPD_Pos                _UINT32_(8)                                          /* (PWM_CMPMUPD) Comparison x Period Update Position */
#define PWM_CMPMUPD_CPRUPD_Msk                (_UINT32_(0xF) << PWM_CMPMUPD_CPRUPD_Pos)            /* (PWM_CMPMUPD) Comparison x Period Update Mask */
#define PWM_CMPMUPD_CPRUPD(value)             (PWM_CMPMUPD_CPRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CPRUPD_Pos)) /* Assigment of value for CPRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_CUPRUPD_Pos               _UINT32_(16)                                         /* (PWM_CMPMUPD) Comparison x Update Period Update Position */
#define PWM_CMPMUPD_CUPRUPD_Msk               (_UINT32_(0xF) << PWM_CMPMUPD_CUPRUPD_Pos)           /* (PWM_CMPMUPD) Comparison x Update Period Update Mask */
#define PWM_CMPMUPD_CUPRUPD(value)            (PWM_CMPMUPD_CUPRUPD_Msk & (_UINT32_(value) << PWM_CMPMUPD_CUPRUPD_Pos)) /* Assigment of value for CUPRUPD in the PWM_CMPMUPD register */
#define PWM_CMPMUPD_Msk                       _UINT32_(0x000F0FF1)                                 /* (PWM_CMPMUPD) Register Mask  */


/* -------- PWM_CLK : (PWM Offset: 0x00) (R/W 32) PWM Clock Register -------- */
#define PWM_CLK_DIVA_Pos                      _UINT32_(0)                                          /* (PWM_CLK) CLKA Divide Factor Position */
#define PWM_CLK_DIVA_Msk                      (_UINT32_(0xFF) << PWM_CLK_DIVA_Pos)                 /* (PWM_CLK) CLKA Divide Factor Mask */
#define PWM_CLK_DIVA(value)                   (PWM_CLK_DIVA_Msk & (_UINT32_(value) << PWM_CLK_DIVA_Pos)) /* Assigment of value for DIVA in the PWM_CLK register */
#define   PWM_CLK_DIVA_CLKA_POFF_Val          _UINT32_(0x0)                                        /* (PWM_CLK) CLKA clock is turned off  */
#define   PWM_CLK_DIVA_PREA_Val               _UINT32_(0x1)                                        /* (PWM_CLK) CLKA clock is clock selected by PREA  */
#define PWM_CLK_DIVA_CLKA_POFF                (PWM_CLK_DIVA_CLKA_POFF_Val << PWM_CLK_DIVA_Pos)     /* (PWM_CLK) CLKA clock is turned off Position  */
#define PWM_CLK_DIVA_PREA                     (PWM_CLK_DIVA_PREA_Val << PWM_CLK_DIVA_Pos)          /* (PWM_CLK) CLKA clock is clock selected by PREA Position  */
#define PWM_CLK_PREA_Pos                      _UINT32_(8)                                          /* (PWM_CLK) CLKA Source Clock Selection Position */
#define PWM_CLK_PREA_Msk                      (_UINT32_(0xF) << PWM_CLK_PREA_Pos)                  /* (PWM_CLK) CLKA Source Clock Selection Mask */
#define PWM_CLK_PREA(value)                   (PWM_CLK_PREA_Msk & (_UINT32_(value) << PWM_CLK_PREA_Pos)) /* Assigment of value for PREA in the PWM_CLK register */
#define   PWM_CLK_PREA_CLK_Val                _UINT32_(0x0)                                        /* (PWM_CLK) Peripheral clock  */
#define   PWM_CLK_PREA_CLK_DIV2_Val           _UINT32_(0x1)                                        /* (PWM_CLK) Peripheral clock/2  */
#define   PWM_CLK_PREA_CLK_DIV4_Val           _UINT32_(0x2)                                        /* (PWM_CLK) Peripheral clock/4  */
#define   PWM_CLK_PREA_CLK_DIV8_Val           _UINT32_(0x3)                                        /* (PWM_CLK) Peripheral clock/8  */
#define   PWM_CLK_PREA_CLK_DIV16_Val          _UINT32_(0x4)                                        /* (PWM_CLK) Peripheral clock/16  */
#define   PWM_CLK_PREA_CLK_DIV32_Val          _UINT32_(0x5)                                        /* (PWM_CLK) Peripheral clock/32  */
#define   PWM_CLK_PREA_CLK_DIV64_Val          _UINT32_(0x6)                                        /* (PWM_CLK) Peripheral clock/64  */
#define   PWM_CLK_PREA_CLK_DIV128_Val         _UINT32_(0x7)                                        /* (PWM_CLK) Peripheral clock/128  */
#define   PWM_CLK_PREA_CLK_DIV256_Val         _UINT32_(0x8)                                        /* (PWM_CLK) Peripheral clock/256  */
#define   PWM_CLK_PREA_CLK_DIV512_Val         _UINT32_(0x9)                                        /* (PWM_CLK) Peripheral clock/512  */
#define   PWM_CLK_PREA_CLK_DIV1024_Val        _UINT32_(0xA)                                        /* (PWM_CLK) Peripheral clock/1024  */
#define PWM_CLK_PREA_CLK                      (PWM_CLK_PREA_CLK_Val << PWM_CLK_PREA_Pos)           /* (PWM_CLK) Peripheral clock Position  */
#define PWM_CLK_PREA_CLK_DIV2                 (PWM_CLK_PREA_CLK_DIV2_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/2 Position  */
#define PWM_CLK_PREA_CLK_DIV4                 (PWM_CLK_PREA_CLK_DIV4_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/4 Position  */
#define PWM_CLK_PREA_CLK_DIV8                 (PWM_CLK_PREA_CLK_DIV8_Val << PWM_CLK_PREA_Pos)      /* (PWM_CLK) Peripheral clock/8 Position  */
#define PWM_CLK_PREA_CLK_DIV16                (PWM_CLK_PREA_CLK_DIV16_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/16 Position  */
#define PWM_CLK_PREA_CLK_DIV32                (PWM_CLK_PREA_CLK_DIV32_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/32 Position  */
#define PWM_CLK_PREA_CLK_DIV64                (PWM_CLK_PREA_CLK_DIV64_Val << PWM_CLK_PREA_Pos)     /* (PWM_CLK) Peripheral clock/64 Position  */
#define PWM_CLK_PREA_CLK_DIV128               (PWM_CLK_PREA_CLK_DIV128_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/128 Position  */
#define PWM_CLK_PREA_CLK_DIV256               (PWM_CLK_PREA_CLK_DIV256_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/256 Position  */
#define PWM_CLK_PREA_CLK_DIV512               (PWM_CLK_PREA_CLK_DIV512_Val << PWM_CLK_PREA_Pos)    /* (PWM_CLK) Peripheral clock/512 Position  */
#define PWM_CLK_PREA_CLK_DIV1024              (PWM_CLK_PREA_CLK_DIV1024_Val << PWM_CLK_PREA_Pos)   /* (PWM_CLK) Peripheral clock/1024 Position  */
#define PWM_CLK_DIVB_Pos                      _UINT32_(16)                                         /* (PWM_CLK) CLKB Divide Factor Position */
#define PWM_CLK_DIVB_Msk                      (_UINT32_(0xFF) << PWM_CLK_DIVB_Pos)                 /* (PWM_CLK) CLKB Divide Factor Mask */
#define PWM_CLK_DIVB(value)                   (PWM_CLK_DIVB_Msk & (_UINT32_(value) << PWM_CLK_DIVB_Pos)) /* Assigment of value for DIVB in the PWM_CLK register */
#define   PWM_CLK_DIVB_CLKB_POFF_Val          _UINT32_(0x0)                                        /* (PWM_CLK) CLKB clock is turned off  */
#define   PWM_CLK_DIVB_PREB_Val               _UINT32_(0x1)                                        /* (PWM_CLK) CLKB clock is clock selected by PREB  */
#define PWM_CLK_DIVB_CLKB_POFF                (PWM_CLK_DIVB_CLKB_POFF_Val << PWM_CLK_DIVB_Pos)     /* (PWM_CLK) CLKB clock is turned off Position  */
#define PWM_CLK_DIVB_PREB                     (PWM_CLK_DIVB_PREB_Val << PWM_CLK_DIVB_Pos)          /* (PWM_CLK) CLKB clock is clock selected by PREB Position  */
#define PWM_CLK_PREB_Pos                      _UINT32_(24)                                         /* (PWM_CLK) CLKB Source Clock Selection Position */
#define PWM_CLK_PREB_Msk                      (_UINT32_(0xF) << PWM_CLK_PREB_Pos)                  /* (PWM_CLK) CLKB Source Clock Selection Mask */
#define PWM_CLK_PREB(value)                   (PWM_CLK_PREB_Msk & (_UINT32_(value) << PWM_CLK_PREB_Pos)) /* Assigment of value for PREB in the PWM_CLK register */
#define   PWM_CLK_PREB_CLK_Val                _UINT32_(0x0)                                        /* (PWM_CLK) Peripheral clock  */
#define   PWM_CLK_PREB_CLK_DIV2_Val           _UINT32_(0x1)                                        /* (PWM_CLK) Peripheral clock/2  */
#define   PWM_CLK_PREB_CLK_DIV4_Val           _UINT32_(0x2)                                        /* (PWM_CLK) Peripheral clock/4  */
#define   PWM_CLK_PREB_CLK_DIV8_Val           _UINT32_(0x3)                                        /* (PWM_CLK) Peripheral clock/8  */
#define   PWM_CLK_PREB_CLK_DIV16_Val          _UINT32_(0x4)                                        /* (PWM_CLK) Peripheral clock/16  */
#define   PWM_CLK_PREB_CLK_DIV32_Val          _UINT32_(0x5)                                        /* (PWM_CLK) Peripheral clock/32  */
#define   PWM_CLK_PREB_CLK_DIV64_Val          _UINT32_(0x6)                                        /* (PWM_CLK) Peripheral clock/64  */
#define   PWM_CLK_PREB_CLK_DIV128_Val         _UINT32_(0x7)                                        /* (PWM_CLK) Peripheral clock/128  */
#define   PWM_CLK_PREB_CLK_DIV256_Val         _UINT32_(0x8)                                        /* (PWM_CLK) Peripheral clock/256  */
#define   PWM_CLK_PREB_CLK_DIV512_Val         _UINT32_(0x9)                                        /* (PWM_CLK) Peripheral clock/512  */
#define   PWM_CLK_PREB_CLK_DIV1024_Val        _UINT32_(0xA)                                        /* (PWM_CLK) Peripheral clock/1024  */
#define PWM_CLK_PREB_CLK                      (PWM_CLK_PREB_CLK_Val << PWM_CLK_PREB_Pos)           /* (PWM_CLK) Peripheral clock Position  */
#define PWM_CLK_PREB_CLK_DIV2                 (PWM_CLK_PREB_CLK_DIV2_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/2 Position  */
#define PWM_CLK_PREB_CLK_DIV4                 (PWM_CLK_PREB_CLK_DIV4_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/4 Position  */
#define PWM_CLK_PREB_CLK_DIV8                 (PWM_CLK_PREB_CLK_DIV8_Val << PWM_CLK_PREB_Pos)      /* (PWM_CLK) Peripheral clock/8 Position  */
#define PWM_CLK_PREB_CLK_DIV16                (PWM_CLK_PREB_CLK_DIV16_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/16 Position  */
#define PWM_CLK_PREB_CLK_DIV32                (PWM_CLK_PREB_CLK_DIV32_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/32 Position  */
#define PWM_CLK_PREB_CLK_DIV64                (PWM_CLK_PREB_CLK_DIV64_Val << PWM_CLK_PREB_Pos)     /* (PWM_CLK) Peripheral clock/64 Position  */
#define PWM_CLK_PREB_CLK_DIV128               (PWM_CLK_PREB_CLK_DIV128_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/128 Position  */
#define PWM_CLK_PREB_CLK_DIV256               (PWM_CLK_PREB_CLK_DIV256_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/256 Position  */
#define PWM_CLK_PREB_CLK_DIV512               (PWM_CLK_PREB_CLK_DIV512_Val << PWM_CLK_PREB_Pos)    /* (PWM_CLK) Peripheral clock/512 Position  */
#define PWM_CLK_PREB_CLK_DIV1024              (PWM_CLK_PREB_CLK_DIV1024_Val << PWM_CLK_PREB_Pos)   /* (PWM_CLK) Peripheral clock/1024 Position  */
#define PWM_CLK_Msk                           _UINT32_(0x0FFF0FFF)                                 /* (PWM_CLK) Register Mask  */


/* -------- PWM_ENA : (PWM Offset: 0x04) ( /W 32) PWM Enable Register -------- */
#define PWM_ENA_CHID0_Pos                     _UINT32_(0)                                          /* (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID0_Msk                     (_UINT32_(0x1) << PWM_ENA_CHID0_Pos)                 /* (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID0(value)                  (PWM_ENA_CHID0_Msk & (_UINT32_(value) << PWM_ENA_CHID0_Pos)) /* Assigment of value for CHID0 in the PWM_ENA register */
#define PWM_ENA_CHID1_Pos                     _UINT32_(1)                                          /* (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID1_Msk                     (_UINT32_(0x1) << PWM_ENA_CHID1_Pos)                 /* (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID1(value)                  (PWM_ENA_CHID1_Msk & (_UINT32_(value) << PWM_ENA_CHID1_Pos)) /* Assigment of value for CHID1 in the PWM_ENA register */
#define PWM_ENA_CHID2_Pos                     _UINT32_(2)                                          /* (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID2_Msk                     (_UINT32_(0x1) << PWM_ENA_CHID2_Pos)                 /* (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID2(value)                  (PWM_ENA_CHID2_Msk & (_UINT32_(value) << PWM_ENA_CHID2_Pos)) /* Assigment of value for CHID2 in the PWM_ENA register */
#define PWM_ENA_CHID3_Pos                     _UINT32_(3)                                          /* (PWM_ENA) Channel ID Position */
#define PWM_ENA_CHID3_Msk                     (_UINT32_(0x1) << PWM_ENA_CHID3_Pos)                 /* (PWM_ENA) Channel ID Mask */
#define PWM_ENA_CHID3(value)                  (PWM_ENA_CHID3_Msk & (_UINT32_(value) << PWM_ENA_CHID3_Pos)) /* Assigment of value for CHID3 in the PWM_ENA register */
#define PWM_ENA_Msk                           _UINT32_(0x0000000F)                                 /* (PWM_ENA) Register Mask  */

#define PWM_ENA_CHID_Pos                      _UINT32_(0)                                          /* (PWM_ENA Position) Channel ID */
#define PWM_ENA_CHID_Msk                      (_UINT32_(0xF) << PWM_ENA_CHID_Pos)                  /* (PWM_ENA Mask) CHID */
#define PWM_ENA_CHID(value)                   (PWM_ENA_CHID_Msk & (_UINT32_(value) << PWM_ENA_CHID_Pos)) 

/* -------- PWM_DIS : (PWM Offset: 0x08) ( /W 32) PWM Disable Register -------- */
#define PWM_DIS_CHID0_Pos                     _UINT32_(0)                                          /* (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID0_Msk                     (_UINT32_(0x1) << PWM_DIS_CHID0_Pos)                 /* (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID0(value)                  (PWM_DIS_CHID0_Msk & (_UINT32_(value) << PWM_DIS_CHID0_Pos)) /* Assigment of value for CHID0 in the PWM_DIS register */
#define PWM_DIS_CHID1_Pos                     _UINT32_(1)                                          /* (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID1_Msk                     (_UINT32_(0x1) << PWM_DIS_CHID1_Pos)                 /* (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID1(value)                  (PWM_DIS_CHID1_Msk & (_UINT32_(value) << PWM_DIS_CHID1_Pos)) /* Assigment of value for CHID1 in the PWM_DIS register */
#define PWM_DIS_CHID2_Pos                     _UINT32_(2)                                          /* (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID2_Msk                     (_UINT32_(0x1) << PWM_DIS_CHID2_Pos)                 /* (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID2(value)                  (PWM_DIS_CHID2_Msk & (_UINT32_(value) << PWM_DIS_CHID2_Pos)) /* Assigment of value for CHID2 in the PWM_DIS register */
#define PWM_DIS_CHID3_Pos                     _UINT32_(3)                                          /* (PWM_DIS) Channel ID Position */
#define PWM_DIS_CHID3_Msk                     (_UINT32_(0x1) << PWM_DIS_CHID3_Pos)                 /* (PWM_DIS) Channel ID Mask */
#define PWM_DIS_CHID3(value)                  (PWM_DIS_CHID3_Msk & (_UINT32_(value) << PWM_DIS_CHID3_Pos)) /* Assigment of value for CHID3 in the PWM_DIS register */
#define PWM_DIS_Msk                           _UINT32_(0x0000000F)                                 /* (PWM_DIS) Register Mask  */

#define PWM_DIS_CHID_Pos                      _UINT32_(0)                                          /* (PWM_DIS Position) Channel ID */
#define PWM_DIS_CHID_Msk                      (_UINT32_(0xF) << PWM_DIS_CHID_Pos)                  /* (PWM_DIS Mask) CHID */
#define PWM_DIS_CHID(value)                   (PWM_DIS_CHID_Msk & (_UINT32_(value) << PWM_DIS_CHID_Pos)) 

/* -------- PWM_SR : (PWM Offset: 0x0C) ( R/ 32) PWM Status Register -------- */
#define PWM_SR_CHID0_Pos                      _UINT32_(0)                                          /* (PWM_SR) Channel ID Position */
#define PWM_SR_CHID0_Msk                      (_UINT32_(0x1) << PWM_SR_CHID0_Pos)                  /* (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID0(value)                   (PWM_SR_CHID0_Msk & (_UINT32_(value) << PWM_SR_CHID0_Pos)) /* Assigment of value for CHID0 in the PWM_SR register */
#define PWM_SR_CHID1_Pos                      _UINT32_(1)                                          /* (PWM_SR) Channel ID Position */
#define PWM_SR_CHID1_Msk                      (_UINT32_(0x1) << PWM_SR_CHID1_Pos)                  /* (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID1(value)                   (PWM_SR_CHID1_Msk & (_UINT32_(value) << PWM_SR_CHID1_Pos)) /* Assigment of value for CHID1 in the PWM_SR register */
#define PWM_SR_CHID2_Pos                      _UINT32_(2)                                          /* (PWM_SR) Channel ID Position */
#define PWM_SR_CHID2_Msk                      (_UINT32_(0x1) << PWM_SR_CHID2_Pos)                  /* (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID2(value)                   (PWM_SR_CHID2_Msk & (_UINT32_(value) << PWM_SR_CHID2_Pos)) /* Assigment of value for CHID2 in the PWM_SR register */
#define PWM_SR_CHID3_Pos                      _UINT32_(3)                                          /* (PWM_SR) Channel ID Position */
#define PWM_SR_CHID3_Msk                      (_UINT32_(0x1) << PWM_SR_CHID3_Pos)                  /* (PWM_SR) Channel ID Mask */
#define PWM_SR_CHID3(value)                   (PWM_SR_CHID3_Msk & (_UINT32_(value) << PWM_SR_CHID3_Pos)) /* Assigment of value for CHID3 in the PWM_SR register */
#define PWM_SR_Msk                            _UINT32_(0x0000000F)                                 /* (PWM_SR) Register Mask  */

#define PWM_SR_CHID_Pos                       _UINT32_(0)                                          /* (PWM_SR Position) Channel ID */
#define PWM_SR_CHID_Msk                       (_UINT32_(0xF) << PWM_SR_CHID_Pos)                   /* (PWM_SR Mask) CHID */
#define PWM_SR_CHID(value)                    (PWM_SR_CHID_Msk & (_UINT32_(value) << PWM_SR_CHID_Pos)) 

