Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/pwm.h
/* -------- PWM_IER1 : (PWM Offset: 0x10) ( /W 32) PWM Interrupt Enable Register 1 -------- */
#define PWM_IER1_CHID0_Pos                    _UINT32_(0)                                          /* (PWM_IER1) Counter Event on Channel 0 Interrupt Enable Position */
#define PWM_IER1_CHID0_Msk                    (_UINT32_(0x1) << PWM_IER1_CHID0_Pos)                /* (PWM_IER1) Counter Event on Channel 0 Interrupt Enable Mask */
#define PWM_IER1_CHID0(value)                 (PWM_IER1_CHID0_Msk & (_UINT32_(value) << PWM_IER1_CHID0_Pos)) /* Assigment of value for CHID0 in the PWM_IER1 register */
#define PWM_IER1_CHID1_Pos                    _UINT32_(1)                                          /* (PWM_IER1) Counter Event on Channel 1 Interrupt Enable Position */
#define PWM_IER1_CHID1_Msk                    (_UINT32_(0x1) << PWM_IER1_CHID1_Pos)                /* (PWM_IER1) Counter Event on Channel 1 Interrupt Enable Mask */
#define PWM_IER1_CHID1(value)                 (PWM_IER1_CHID1_Msk & (_UINT32_(value) << PWM_IER1_CHID1_Pos)) /* Assigment of value for CHID1 in the PWM_IER1 register */
#define PWM_IER1_CHID2_Pos                    _UINT32_(2)                                          /* (PWM_IER1) Counter Event on Channel 2 Interrupt Enable Position */
#define PWM_IER1_CHID2_Msk                    (_UINT32_(0x1) << PWM_IER1_CHID2_Pos)                /* (PWM_IER1) Counter Event on Channel 2 Interrupt Enable Mask */
#define PWM_IER1_CHID2(value)                 (PWM_IER1_CHID2_Msk & (_UINT32_(value) << PWM_IER1_CHID2_Pos)) /* Assigment of value for CHID2 in the PWM_IER1 register */
#define PWM_IER1_CHID3_Pos                    _UINT32_(3)                                          /* (PWM_IER1) Counter Event on Channel 3 Interrupt Enable Position */
#define PWM_IER1_CHID3_Msk                    (_UINT32_(0x1) << PWM_IER1_CHID3_Pos)                /* (PWM_IER1) Counter Event on Channel 3 Interrupt Enable Mask */
#define PWM_IER1_CHID3(value)                 (PWM_IER1_CHID3_Msk & (_UINT32_(value) << PWM_IER1_CHID3_Pos)) /* Assigment of value for CHID3 in the PWM_IER1 register */
#define PWM_IER1_FCHID0_Pos                   _UINT32_(16)                                         /* (PWM_IER1) Fault Protection Trigger on Channel 0 Interrupt Enable Position */
#define PWM_IER1_FCHID0_Msk                   (_UINT32_(0x1) << PWM_IER1_FCHID0_Pos)               /* (PWM_IER1) Fault Protection Trigger on Channel 0 Interrupt Enable Mask */
#define PWM_IER1_FCHID0(value)                (PWM_IER1_FCHID0_Msk & (_UINT32_(value) << PWM_IER1_FCHID0_Pos)) /* Assigment of value for FCHID0 in the PWM_IER1 register */
#define PWM_IER1_FCHID1_Pos                   _UINT32_(17)                                         /* (PWM_IER1) Fault Protection Trigger on Channel 1 Interrupt Enable Position */
#define PWM_IER1_FCHID1_Msk                   (_UINT32_(0x1) << PWM_IER1_FCHID1_Pos)               /* (PWM_IER1) Fault Protection Trigger on Channel 1 Interrupt Enable Mask */
#define PWM_IER1_FCHID1(value)                (PWM_IER1_FCHID1_Msk & (_UINT32_(value) << PWM_IER1_FCHID1_Pos)) /* Assigment of value for FCHID1 in the PWM_IER1 register */
#define PWM_IER1_FCHID2_Pos                   _UINT32_(18)                                         /* (PWM_IER1) Fault Protection Trigger on Channel 2 Interrupt Enable Position */
#define PWM_IER1_FCHID2_Msk                   (_UINT32_(0x1) << PWM_IER1_FCHID2_Pos)               /* (PWM_IER1) Fault Protection Trigger on Channel 2 Interrupt Enable Mask */
#define PWM_IER1_FCHID2(value)                (PWM_IER1_FCHID2_Msk & (_UINT32_(value) << PWM_IER1_FCHID2_Pos)) /* Assigment of value for FCHID2 in the PWM_IER1 register */
#define PWM_IER1_FCHID3_Pos                   _UINT32_(19)                                         /* (PWM_IER1) Fault Protection Trigger on Channel 3 Interrupt Enable Position */
#define PWM_IER1_FCHID3_Msk                   (_UINT32_(0x1) << PWM_IER1_FCHID3_Pos)               /* (PWM_IER1) Fault Protection Trigger on Channel 3 Interrupt Enable Mask */
#define PWM_IER1_FCHID3(value)                (PWM_IER1_FCHID3_Msk & (_UINT32_(value) << PWM_IER1_FCHID3_Pos)) /* Assigment of value for FCHID3 in the PWM_IER1 register */
#define PWM_IER1_Msk                          _UINT32_(0x000F000F)                                 /* (PWM_IER1) Register Mask  */

#define PWM_IER1_CHID_Pos                     _UINT32_(0)                                          /* (PWM_IER1 Position) Counter Event on Channel x Interrupt Enable */
#define PWM_IER1_CHID_Msk                     (_UINT32_(0xF) << PWM_IER1_CHID_Pos)                 /* (PWM_IER1 Mask) CHID */
#define PWM_IER1_CHID(value)                  (PWM_IER1_CHID_Msk & (_UINT32_(value) << PWM_IER1_CHID_Pos)) 
#define PWM_IER1_FCHID_Pos                    _UINT32_(16)                                         /* (PWM_IER1 Position) Fault Protection Trigger on Channel 3 Interrupt Enable */
#define PWM_IER1_FCHID_Msk                    (_UINT32_(0xF) << PWM_IER1_FCHID_Pos)                /* (PWM_IER1 Mask) FCHID */
#define PWM_IER1_FCHID(value)                 (PWM_IER1_FCHID_Msk & (_UINT32_(value) << PWM_IER1_FCHID_Pos)) 

/* -------- PWM_IDR1 : (PWM Offset: 0x14) ( /W 32) PWM Interrupt Disable Register 1 -------- */
#define PWM_IDR1_CHID0_Pos                    _UINT32_(0)                                          /* (PWM_IDR1) Counter Event on Channel 0 Interrupt Disable Position */
#define PWM_IDR1_CHID0_Msk                    (_UINT32_(0x1) << PWM_IDR1_CHID0_Pos)                /* (PWM_IDR1) Counter Event on Channel 0 Interrupt Disable Mask */
#define PWM_IDR1_CHID0(value)                 (PWM_IDR1_CHID0_Msk & (_UINT32_(value) << PWM_IDR1_CHID0_Pos)) /* Assigment of value for CHID0 in the PWM_IDR1 register */
#define PWM_IDR1_CHID1_Pos                    _UINT32_(1)                                          /* (PWM_IDR1) Counter Event on Channel 1 Interrupt Disable Position */
#define PWM_IDR1_CHID1_Msk                    (_UINT32_(0x1) << PWM_IDR1_CHID1_Pos)                /* (PWM_IDR1) Counter Event on Channel 1 Interrupt Disable Mask */
#define PWM_IDR1_CHID1(value)                 (PWM_IDR1_CHID1_Msk & (_UINT32_(value) << PWM_IDR1_CHID1_Pos)) /* Assigment of value for CHID1 in the PWM_IDR1 register */
#define PWM_IDR1_CHID2_Pos                    _UINT32_(2)                                          /* (PWM_IDR1) Counter Event on Channel 2 Interrupt Disable Position */
#define PWM_IDR1_CHID2_Msk                    (_UINT32_(0x1) << PWM_IDR1_CHID2_Pos)                /* (PWM_IDR1) Counter Event on Channel 2 Interrupt Disable Mask */
#define PWM_IDR1_CHID2(value)                 (PWM_IDR1_CHID2_Msk & (_UINT32_(value) << PWM_IDR1_CHID2_Pos)) /* Assigment of value for CHID2 in the PWM_IDR1 register */
#define PWM_IDR1_CHID3_Pos                    _UINT32_(3)                                          /* (PWM_IDR1) Counter Event on Channel 3 Interrupt Disable Position */
#define PWM_IDR1_CHID3_Msk                    (_UINT32_(0x1) << PWM_IDR1_CHID3_Pos)                /* (PWM_IDR1) Counter Event on Channel 3 Interrupt Disable Mask */
#define PWM_IDR1_CHID3(value)                 (PWM_IDR1_CHID3_Msk & (_UINT32_(value) << PWM_IDR1_CHID3_Pos)) /* Assigment of value for CHID3 in the PWM_IDR1 register */
#define PWM_IDR1_FCHID0_Pos                   _UINT32_(16)                                         /* (PWM_IDR1) Fault Protection Trigger on Channel 0 Interrupt Disable Position */
#define PWM_IDR1_FCHID0_Msk                   (_UINT32_(0x1) << PWM_IDR1_FCHID0_Pos)               /* (PWM_IDR1) Fault Protection Trigger on Channel 0 Interrupt Disable Mask */
#define PWM_IDR1_FCHID0(value)                (PWM_IDR1_FCHID0_Msk & (_UINT32_(value) << PWM_IDR1_FCHID0_Pos)) /* Assigment of value for FCHID0 in the PWM_IDR1 register */
#define PWM_IDR1_FCHID1_Pos                   _UINT32_(17)                                         /* (PWM_IDR1) Fault Protection Trigger on Channel 1 Interrupt Disable Position */
#define PWM_IDR1_FCHID1_Msk                   (_UINT32_(0x1) << PWM_IDR1_FCHID1_Pos)               /* (PWM_IDR1) Fault Protection Trigger on Channel 1 Interrupt Disable Mask */
#define PWM_IDR1_FCHID1(value)                (PWM_IDR1_FCHID1_Msk & (_UINT32_(value) << PWM_IDR1_FCHID1_Pos)) /* Assigment of value for FCHID1 in the PWM_IDR1 register */
#define PWM_IDR1_FCHID2_Pos                   _UINT32_(18)                                         /* (PWM_IDR1) Fault Protection Trigger on Channel 2 Interrupt Disable Position */
#define PWM_IDR1_FCHID2_Msk                   (_UINT32_(0x1) << PWM_IDR1_FCHID2_Pos)               /* (PWM_IDR1) Fault Protection Trigger on Channel 2 Interrupt Disable Mask */
#define PWM_IDR1_FCHID2(value)                (PWM_IDR1_FCHID2_Msk & (_UINT32_(value) << PWM_IDR1_FCHID2_Pos)) /* Assigment of value for FCHID2 in the PWM_IDR1 register */
#define PWM_IDR1_FCHID3_Pos                   _UINT32_(19)                                         /* (PWM_IDR1) Fault Protection Trigger on Channel 3 Interrupt Disable Position */
#define PWM_IDR1_FCHID3_Msk                   (_UINT32_(0x1) << PWM_IDR1_FCHID3_Pos)               /* (PWM_IDR1) Fault Protection Trigger on Channel 3 Interrupt Disable Mask */
#define PWM_IDR1_FCHID3(value)                (PWM_IDR1_FCHID3_Msk & (_UINT32_(value) << PWM_IDR1_FCHID3_Pos)) /* Assigment of value for FCHID3 in the PWM_IDR1 register */
#define PWM_IDR1_Msk                          _UINT32_(0x000F000F)                                 /* (PWM_IDR1) Register Mask  */

#define PWM_IDR1_CHID_Pos                     _UINT32_(0)                                          /* (PWM_IDR1 Position) Counter Event on Channel x Interrupt Disable */
#define PWM_IDR1_CHID_Msk                     (_UINT32_(0xF) << PWM_IDR1_CHID_Pos)                 /* (PWM_IDR1 Mask) CHID */
#define PWM_IDR1_CHID(value)                  (PWM_IDR1_CHID_Msk & (_UINT32_(value) << PWM_IDR1_CHID_Pos)) 
#define PWM_IDR1_FCHID_Pos                    _UINT32_(16)                                         /* (PWM_IDR1 Position) Fault Protection Trigger on Channel 3 Interrupt Disable */
#define PWM_IDR1_FCHID_Msk                    (_UINT32_(0xF) << PWM_IDR1_FCHID_Pos)                /* (PWM_IDR1 Mask) FCHID */
#define PWM_IDR1_FCHID(value)                 (PWM_IDR1_FCHID_Msk & (_UINT32_(value) << PWM_IDR1_FCHID_Pos)) 

/* -------- PWM_IMR1 : (PWM Offset: 0x18) ( R/ 32) PWM Interrupt Mask Register 1 -------- */
#define PWM_IMR1_CHID0_Pos                    _UINT32_(0)                                          /* (PWM_IMR1) Counter Event on Channel 0 Interrupt Mask Position */
#define PWM_IMR1_CHID0_Msk                    (_UINT32_(0x1) << PWM_IMR1_CHID0_Pos)                /* (PWM_IMR1) Counter Event on Channel 0 Interrupt Mask Mask */
#define PWM_IMR1_CHID0(value)                 (PWM_IMR1_CHID0_Msk & (_UINT32_(value) << PWM_IMR1_CHID0_Pos)) /* Assigment of value for CHID0 in the PWM_IMR1 register */
#define PWM_IMR1_CHID1_Pos                    _UINT32_(1)                                          /* (PWM_IMR1) Counter Event on Channel 1 Interrupt Mask Position */
#define PWM_IMR1_CHID1_Msk                    (_UINT32_(0x1) << PWM_IMR1_CHID1_Pos)                /* (PWM_IMR1) Counter Event on Channel 1 Interrupt Mask Mask */
#define PWM_IMR1_CHID1(value)                 (PWM_IMR1_CHID1_Msk & (_UINT32_(value) << PWM_IMR1_CHID1_Pos)) /* Assigment of value for CHID1 in the PWM_IMR1 register */
#define PWM_IMR1_CHID2_Pos                    _UINT32_(2)                                          /* (PWM_IMR1) Counter Event on Channel 2 Interrupt Mask Position */
#define PWM_IMR1_CHID2_Msk                    (_UINT32_(0x1) << PWM_IMR1_CHID2_Pos)                /* (PWM_IMR1) Counter Event on Channel 2 Interrupt Mask Mask */
#define PWM_IMR1_CHID2(value)                 (PWM_IMR1_CHID2_Msk & (_UINT32_(value) << PWM_IMR1_CHID2_Pos)) /* Assigment of value for CHID2 in the PWM_IMR1 register */
#define PWM_IMR1_CHID3_Pos                    _UINT32_(3)                                          /* (PWM_IMR1) Counter Event on Channel 3 Interrupt Mask Position */
#define PWM_IMR1_CHID3_Msk                    (_UINT32_(0x1) << PWM_IMR1_CHID3_Pos)                /* (PWM_IMR1) Counter Event on Channel 3 Interrupt Mask Mask */
#define PWM_IMR1_CHID3(value)                 (PWM_IMR1_CHID3_Msk & (_UINT32_(value) << PWM_IMR1_CHID3_Pos)) /* Assigment of value for CHID3 in the PWM_IMR1 register */
#define PWM_IMR1_FCHID0_Pos                   _UINT32_(16)                                         /* (PWM_IMR1) Fault Protection Trigger on Channel 0 Interrupt Mask Position */
#define PWM_IMR1_FCHID0_Msk                   (_UINT32_(0x1) << PWM_IMR1_FCHID0_Pos)               /* (PWM_IMR1) Fault Protection Trigger on Channel 0 Interrupt Mask Mask */
#define PWM_IMR1_FCHID0(value)                (PWM_IMR1_FCHID0_Msk & (_UINT32_(value) << PWM_IMR1_FCHID0_Pos)) /* Assigment of value for FCHID0 in the PWM_IMR1 register */
#define PWM_IMR1_FCHID1_Pos                   _UINT32_(17)                                         /* (PWM_IMR1) Fault Protection Trigger on Channel 1 Interrupt Mask Position */
#define PWM_IMR1_FCHID1_Msk                   (_UINT32_(0x1) << PWM_IMR1_FCHID1_Pos)               /* (PWM_IMR1) Fault Protection Trigger on Channel 1 Interrupt Mask Mask */
#define PWM_IMR1_FCHID1(value)                (PWM_IMR1_FCHID1_Msk & (_UINT32_(value) << PWM_IMR1_FCHID1_Pos)) /* Assigment of value for FCHID1 in the PWM_IMR1 register */
#define PWM_IMR1_FCHID2_Pos                   _UINT32_(18)                                         /* (PWM_IMR1) Fault Protection Trigger on Channel 2 Interrupt Mask Position */
#define PWM_IMR1_FCHID2_Msk                   (_UINT32_(0x1) << PWM_IMR1_FCHID2_Pos)               /* (PWM_IMR1) Fault Protection Trigger on Channel 2 Interrupt Mask Mask */
#define PWM_IMR1_FCHID2(value)                (PWM_IMR1_FCHID2_Msk & (_UINT32_(value) << PWM_IMR1_FCHID2_Pos)) /* Assigment of value for FCHID2 in the PWM_IMR1 register */
#define PWM_IMR1_FCHID3_Pos                   _UINT32_(19)                                         /* (PWM_IMR1) Fault Protection Trigger on Channel 3 Interrupt Mask Position */
#define PWM_IMR1_FCHID3_Msk                   (_UINT32_(0x1) << PWM_IMR1_FCHID3_Pos)               /* (PWM_IMR1) Fault Protection Trigger on Channel 3 Interrupt Mask Mask */
#define PWM_IMR1_FCHID3(value)                (PWM_IMR1_FCHID3_Msk & (_UINT32_(value) << PWM_IMR1_FCHID3_Pos)) /* Assigment of value for FCHID3 in the PWM_IMR1 register */
#define PWM_IMR1_Msk                          _UINT32_(0x000F000F)                                 /* (PWM_IMR1) Register Mask  */

#define PWM_IMR1_CHID_Pos                     _UINT32_(0)                                          /* (PWM_IMR1 Position) Counter Event on Channel x Interrupt Mask */
#define PWM_IMR1_CHID_Msk                     (_UINT32_(0xF) << PWM_IMR1_CHID_Pos)                 /* (PWM_IMR1 Mask) CHID */
#define PWM_IMR1_CHID(value)                  (PWM_IMR1_CHID_Msk & (_UINT32_(value) << PWM_IMR1_CHID_Pos)) 
#define PWM_IMR1_FCHID_Pos                    _UINT32_(16)                                         /* (PWM_IMR1 Position) Fault Protection Trigger on Channel 3 Interrupt Mask */
#define PWM_IMR1_FCHID_Msk                    (_UINT32_(0xF) << PWM_IMR1_FCHID_Pos)                /* (PWM_IMR1 Mask) FCHID */
#define PWM_IMR1_FCHID(value)                 (PWM_IMR1_FCHID_Msk & (_UINT32_(value) << PWM_IMR1_FCHID_Pos)) 

/* -------- PWM_ISR1 : (PWM Offset: 0x1C) ( R/ 32) PWM Interrupt Status Register 1 -------- */
#define PWM_ISR1_CHID0_Pos                    _UINT32_(0)                                          /* (PWM_ISR1) Counter Event on Channel 0 Position */
#define PWM_ISR1_CHID0_Msk                    (_UINT32_(0x1) << PWM_ISR1_CHID0_Pos)                /* (PWM_ISR1) Counter Event on Channel 0 Mask */
#define PWM_ISR1_CHID0(value)                 (PWM_ISR1_CHID0_Msk & (_UINT32_(value) << PWM_ISR1_CHID0_Pos)) /* Assigment of value for CHID0 in the PWM_ISR1 register */
#define PWM_ISR1_CHID1_Pos                    _UINT32_(1)                                          /* (PWM_ISR1) Counter Event on Channel 1 Position */
#define PWM_ISR1_CHID1_Msk                    (_UINT32_(0x1) << PWM_ISR1_CHID1_Pos)                /* (PWM_ISR1) Counter Event on Channel 1 Mask */
#define PWM_ISR1_CHID1(value)                 (PWM_ISR1_CHID1_Msk & (_UINT32_(value) << PWM_ISR1_CHID1_Pos)) /* Assigment of value for CHID1 in the PWM_ISR1 register */
#define PWM_ISR1_CHID2_Pos                    _UINT32_(2)                                          /* (PWM_ISR1) Counter Event on Channel 2 Position */
#define PWM_ISR1_CHID2_Msk                    (_UINT32_(0x1) << PWM_ISR1_CHID2_Pos)                /* (PWM_ISR1) Counter Event on Channel 2 Mask */
#define PWM_ISR1_CHID2(value)                 (PWM_ISR1_CHID2_Msk & (_UINT32_(value) << PWM_ISR1_CHID2_Pos)) /* Assigment of value for CHID2 in the PWM_ISR1 register */
#define PWM_ISR1_CHID3_Pos                    _UINT32_(3)                                          /* (PWM_ISR1) Counter Event on Channel 3 Position */
#define PWM_ISR1_CHID3_Msk                    (_UINT32_(0x1) << PWM_ISR1_CHID3_Pos)                /* (PWM_ISR1) Counter Event on Channel 3 Mask */
#define PWM_ISR1_CHID3(value)                 (PWM_ISR1_CHID3_Msk & (_UINT32_(value) << PWM_ISR1_CHID3_Pos)) /* Assigment of value for CHID3 in the PWM_ISR1 register */
#define PWM_ISR1_FCHID0_Pos                   _UINT32_(16)                                         /* (PWM_ISR1) Fault Protection Trigger on Channel 0 Position */
#define PWM_ISR1_FCHID0_Msk                   (_UINT32_(0x1) << PWM_ISR1_FCHID0_Pos)               /* (PWM_ISR1) Fault Protection Trigger on Channel 0 Mask */
#define PWM_ISR1_FCHID0(value)                (PWM_ISR1_FCHID0_Msk & (_UINT32_(value) << PWM_ISR1_FCHID0_Pos)) /* Assigment of value for FCHID0 in the PWM_ISR1 register */
#define PWM_ISR1_FCHID1_Pos                   _UINT32_(17)                                         /* (PWM_ISR1) Fault Protection Trigger on Channel 1 Position */
#define PWM_ISR1_FCHID1_Msk                   (_UINT32_(0x1) << PWM_ISR1_FCHID1_Pos)               /* (PWM_ISR1) Fault Protection Trigger on Channel 1 Mask */
#define PWM_ISR1_FCHID1(value)                (PWM_ISR1_FCHID1_Msk & (_UINT32_(value) << PWM_ISR1_FCHID1_Pos)) /* Assigment of value for FCHID1 in the PWM_ISR1 register */
#define PWM_ISR1_FCHID2_Pos                   _UINT32_(18)                                         /* (PWM_ISR1) Fault Protection Trigger on Channel 2 Position */
#define PWM_ISR1_FCHID2_Msk                   (_UINT32_(0x1) << PWM_ISR1_FCHID2_Pos)               /* (PWM_ISR1) Fault Protection Trigger on Channel 2 Mask */
#define PWM_ISR1_FCHID2(value)                (PWM_ISR1_FCHID2_Msk & (_UINT32_(value) << PWM_ISR1_FCHID2_Pos)) /* Assigment of value for FCHID2 in the PWM_ISR1 register */
#define PWM_ISR1_FCHID3_Pos                   _UINT32_(19)                                         /* (PWM_ISR1) Fault Protection Trigger on Channel 3 Position */
#define PWM_ISR1_FCHID3_Msk                   (_UINT32_(0x1) << PWM_ISR1_FCHID3_Pos)               /* (PWM_ISR1) Fault Protection Trigger on Channel 3 Mask */
#define PWM_ISR1_FCHID3(value)                (PWM_ISR1_FCHID3_Msk & (_UINT32_(value) << PWM_ISR1_FCHID3_Pos)) /* Assigment of value for FCHID3 in the PWM_ISR1 register */
#define PWM_ISR1_Msk                          _UINT32_(0x000F000F)                                 /* (PWM_ISR1) Register Mask  */

#define PWM_ISR1_CHID_Pos                     _UINT32_(0)                                          /* (PWM_ISR1 Position) Counter Event on Channel x */
#define PWM_ISR1_CHID_Msk                     (_UINT32_(0xF) << PWM_ISR1_CHID_Pos)                 /* (PWM_ISR1 Mask) CHID */
#define PWM_ISR1_CHID(value)                  (PWM_ISR1_CHID_Msk & (_UINT32_(value) << PWM_ISR1_CHID_Pos)) 
#define PWM_ISR1_FCHID_Pos                    _UINT32_(16)                                         /* (PWM_ISR1 Position) Fault Protection Trigger on Channel 3 */
#define PWM_ISR1_FCHID_Msk                    (_UINT32_(0xF) << PWM_ISR1_FCHID_Pos)                /* (PWM_ISR1 Mask) FCHID */
#define PWM_ISR1_FCHID(value)                 (PWM_ISR1_FCHID_Msk & (_UINT32_(value) << PWM_ISR1_FCHID_Pos)) 

