Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/pwm.h
#define PWM_ISR2_CMPM_Pos                     _UINT32_(8)                                          /* (PWM_ISR2 Position) Comparison x Match */
#define PWM_ISR2_CMPM_Msk                     (_UINT32_(0xFF) << PWM_ISR2_CMPM_Pos)                /* (PWM_ISR2 Mask) CMPM */
#define PWM_ISR2_CMPM(value)                  (PWM_ISR2_CMPM_Msk & (_UINT32_(value) << PWM_ISR2_CMPM_Pos)) 
#define PWM_ISR2_CMPU_Pos                     _UINT32_(16)                                         /* (PWM_ISR2 Position) Comparison 7 Update */
#define PWM_ISR2_CMPU_Msk                     (_UINT32_(0xFF) << PWM_ISR2_CMPU_Pos)                /* (PWM_ISR2 Mask) CMPU */
#define PWM_ISR2_CMPU(value)                  (PWM_ISR2_CMPU_Msk & (_UINT32_(value) << PWM_ISR2_CMPU_Pos)) 

/* -------- PWM_OOV : (PWM Offset: 0x44) (R/W 32) PWM Output Override Value Register -------- */
#define PWM_OOV_OOVH0_Pos                     _UINT32_(0)                                          /* (PWM_OOV) Output Override Value for PWMH output of the channel 0 Position */
#define PWM_OOV_OOVH0_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVH0_Pos)                 /* (PWM_OOV) Output Override Value for PWMH output of the channel 0 Mask */
#define PWM_OOV_OOVH0(value)                  (PWM_OOV_OOVH0_Msk & (_UINT32_(value) << PWM_OOV_OOVH0_Pos)) /* Assigment of value for OOVH0 in the PWM_OOV register */
#define PWM_OOV_OOVH1_Pos                     _UINT32_(1)                                          /* (PWM_OOV) Output Override Value for PWMH output of the channel 1 Position */
#define PWM_OOV_OOVH1_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVH1_Pos)                 /* (PWM_OOV) Output Override Value for PWMH output of the channel 1 Mask */
#define PWM_OOV_OOVH1(value)                  (PWM_OOV_OOVH1_Msk & (_UINT32_(value) << PWM_OOV_OOVH1_Pos)) /* Assigment of value for OOVH1 in the PWM_OOV register */
#define PWM_OOV_OOVH2_Pos                     _UINT32_(2)                                          /* (PWM_OOV) Output Override Value for PWMH output of the channel 2 Position */
#define PWM_OOV_OOVH2_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVH2_Pos)                 /* (PWM_OOV) Output Override Value for PWMH output of the channel 2 Mask */
#define PWM_OOV_OOVH2(value)                  (PWM_OOV_OOVH2_Msk & (_UINT32_(value) << PWM_OOV_OOVH2_Pos)) /* Assigment of value for OOVH2 in the PWM_OOV register */
#define PWM_OOV_OOVH3_Pos                     _UINT32_(3)                                          /* (PWM_OOV) Output Override Value for PWMH output of the channel 3 Position */
#define PWM_OOV_OOVH3_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVH3_Pos)                 /* (PWM_OOV) Output Override Value for PWMH output of the channel 3 Mask */
#define PWM_OOV_OOVH3(value)                  (PWM_OOV_OOVH3_Msk & (_UINT32_(value) << PWM_OOV_OOVH3_Pos)) /* Assigment of value for OOVH3 in the PWM_OOV register */
#define PWM_OOV_OOVL0_Pos                     _UINT32_(16)                                         /* (PWM_OOV) Output Override Value for PWML output of the channel 0 Position */
#define PWM_OOV_OOVL0_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVL0_Pos)                 /* (PWM_OOV) Output Override Value for PWML output of the channel 0 Mask */
#define PWM_OOV_OOVL0(value)                  (PWM_OOV_OOVL0_Msk & (_UINT32_(value) << PWM_OOV_OOVL0_Pos)) /* Assigment of value for OOVL0 in the PWM_OOV register */
#define PWM_OOV_OOVL1_Pos                     _UINT32_(17)                                         /* (PWM_OOV) Output Override Value for PWML output of the channel 1 Position */
#define PWM_OOV_OOVL1_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVL1_Pos)                 /* (PWM_OOV) Output Override Value for PWML output of the channel 1 Mask */
#define PWM_OOV_OOVL1(value)                  (PWM_OOV_OOVL1_Msk & (_UINT32_(value) << PWM_OOV_OOVL1_Pos)) /* Assigment of value for OOVL1 in the PWM_OOV register */
#define PWM_OOV_OOVL2_Pos                     _UINT32_(18)                                         /* (PWM_OOV) Output Override Value for PWML output of the channel 2 Position */
#define PWM_OOV_OOVL2_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVL2_Pos)                 /* (PWM_OOV) Output Override Value for PWML output of the channel 2 Mask */
#define PWM_OOV_OOVL2(value)                  (PWM_OOV_OOVL2_Msk & (_UINT32_(value) << PWM_OOV_OOVL2_Pos)) /* Assigment of value for OOVL2 in the PWM_OOV register */
#define PWM_OOV_OOVL3_Pos                     _UINT32_(19)                                         /* (PWM_OOV) Output Override Value for PWML output of the channel 3 Position */
#define PWM_OOV_OOVL3_Msk                     (_UINT32_(0x1) << PWM_OOV_OOVL3_Pos)                 /* (PWM_OOV) Output Override Value for PWML output of the channel 3 Mask */
#define PWM_OOV_OOVL3(value)                  (PWM_OOV_OOVL3_Msk & (_UINT32_(value) << PWM_OOV_OOVL3_Pos)) /* Assigment of value for OOVL3 in the PWM_OOV register */
#define PWM_OOV_Msk                           _UINT32_(0x000F000F)                                 /* (PWM_OOV) Register Mask  */

#define PWM_OOV_OOVH_Pos                      _UINT32_(0)                                          /* (PWM_OOV Position) Output Override Value for PWMH output of the channel x */
#define PWM_OOV_OOVH_Msk                      (_UINT32_(0xF) << PWM_OOV_OOVH_Pos)                  /* (PWM_OOV Mask) OOVH */
#define PWM_OOV_OOVH(value)                   (PWM_OOV_OOVH_Msk & (_UINT32_(value) << PWM_OOV_OOVH_Pos)) 
#define PWM_OOV_OOVL_Pos                      _UINT32_(16)                                         /* (PWM_OOV Position) Output Override Value for PWML output of the channel 3 */
#define PWM_OOV_OOVL_Msk                      (_UINT32_(0xF) << PWM_OOV_OOVL_Pos)                  /* (PWM_OOV Mask) OOVL */
#define PWM_OOV_OOVL(value)                   (PWM_OOV_OOVL_Msk & (_UINT32_(value) << PWM_OOV_OOVL_Pos)) 

